VDowbensky/HC32/HC32L07x/HC32L07x_IDE_Rev1.1.0/IAR_IDE/config/debugger/HDSC/HC32L072PATA.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="SPI0">
            <name>SPI1</name>
            <description>desc SPI</description>
            <baseAddress>0x40004800</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x18</size>
            </addressBlock>
        </peripheral>
        <peripheral>
            <name>SYSCTRL</name>
            <description>desc SYSCTRL</description>
            <baseAddress>0x40002000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x5C</size>
            </addressBlock>
            <registers>
                <register>
                    <name>SYSCTRL0</name>
                    <description>desc SYSCTRL0</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1</resetValue>
                    <resetMask>0x9FFF</resetMask>
                    <fields>
                        <field>
                            <name>RCH_EN</name>
                            <description>desc RCH_EN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>XTH_EN</name>
                            <description>desc XTH_EN</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RCL_EN</name>
                            <description>desc RCL_EN</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>XTL_EN</name>
                            <description>desc XTL_EN</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLL_EN</name>
                            <description>desc PLL_EN</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLKSW</name>
                            <description>desc CLKSW</description>
                            <msb>7</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HCLK_PRS</name>
                            <description>desc HCLK_PRS</description>
                            <msb>10</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PCLK_PRS</name>
                            <description>desc PCLK_PRS</description>
                            <msb>12</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WAKEUP_BYRCH</name>
                            <description>desc WAKEUP_BYRCH</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RSV</name>
                            <description>desc RSV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTRL1</name>
                    <description>desc SYSCTRL1</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x8</resetValue>
                    <resetMask>0xF7E</resetMask>
                    <fields>
                        <field>
                            <name>EXTH_EN</name>
                            <description>desc EXTH_EN</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXTL_EN</name>
                            <description>desc EXTL_EN</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>XTL_ALWAYS_ON</name>
                            <description>desc XTL_ALWAYS_ON</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RTC_LPW</name>
                            <description>desc RTC_LPW</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LOCKUP_EN</name>
                            <description>desc LOCKUP_EN</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SWD_USE_IO</name>
                            <description>desc SWD_USE_IO</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RTC_FREQ_ADJUST</name>
                            <description>desc RTC_FREQ_ADJUST</description>
                            <msb>11</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USB48MSEL</name>
                            <description>desc USB48MSEL</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RSV</name>
                            <description>desc RSV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTRL2</name>
                    <description>desc SYSCTRL2</description>
                    <addressOffset>0x8</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SYSCTRL2</name>
                            <description>desc SYSCTRL2</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>RSV</name>
                            <description>desc RSV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RCH_CR</name>
                    <description>desc RCH_CR</description>
                    <addressOffset>0xC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x126</resetValue>
                    <resetMask>0xFFF</resetMask>
                    <fields>
                        <field>
                            <name>TRIM</name>
                            <description>desc TRIM</description>
                            <msb>10</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STABLE</name>
                            <description>desc STABLE</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RSV</name>
                            <description>desc RSV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>XTH_CR</name>
                    <description>desc XTH_CR</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x22</resetValue>
                    <resetMask>0x7F</resetMask>
                    <fields>
                        <field>
                            <name>DRIVER</name>
                            <description>desc DRIVER</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>XTH_FSEL</name>
                            <description>desc XTH_FSEL</description>
                            <msb>3</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STARTUP</name>
                            <description>desc STARTUP</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STABLE</name>
                            <description>desc STABLE</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RSV</name>
                            <description>desc RSV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RCL_CR</name>
                    <description>desc RCL_CR</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x33F</resetValue>
                    <resetMask>0x1FFF</resetMask>
                    <fields>
                        <field>
                            <name>TRIM</name>
                            <description>desc TRIM</description>
                            <msb>9</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STARTUP</name>
                            <description>desc STARTUP</description>
                            <msb>11</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STABLE</name>
                            <description>desc STABLE</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RSV</name>
                            <description>desc RSV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>XTL_CR</name>
                    <description>desc XTL_CR</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x21</resetValue>
                    <resetMask>0x7F</resetMask>
                    <fields>
                        <field>
                            <name>DRIVER</name>
                            <description>desc DRIVER</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AMP_SEL</name>
                            <description>desc AMP_SEL</description>
                            <msb>3</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STARTUP</name>
                            <description>desc STARTUP</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STABLE</name>
                            <description>desc STABLE</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RSV</name>
                            <description>desc RSV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
