VDowbensky/HC32/HC32L07x/HC32L07x_IDE_Rev1.1.0/IAR_IDE/config/debugger/HDSC/HC32L072PATA.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>WDT</name>
            <description>desc WDT</description>
            <baseAddress>0x40000F00</baseAddress>
            <alternatePeripheral>LPTIMER0</alternatePeripheral>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x88</size>
            </addressBlock>
            <registers>
                <register>
                    <name>RST</name>
                    <description>desc RST</description>
                    <addressOffset>0x80</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>RST</name>
                            <description>desc RST</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>RSV</name>
                            <description>desc RSV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CON</name>
                    <description>desc CON</description>
                    <addressOffset>0x84</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xF</resetValue>
                    <resetMask>0xFFBF</resetMask>
                    <fields>
                        <field>
                            <name>WOV</name>
                            <description>desc WOV</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>R</name>
                            <description>desc R</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>WINT_EN</name>
                            <description>desc WINT_EN</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INT</name>
                            <description>desc INT</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>WCNTL</name>
                            <description>desc WCNTL</description>
                            <msb>15</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RSV</name>
                            <description>desc RSV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
    </peripherals>
</device>
